import 'package:flutter/material.dart';
import 'package:joy_guru/screens/CommonWidgets/TextWidgets.dart';

class UpasonaScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("উপাসনা"),
      ),
      body: Container(
        child: ListView(
          children: [
            HeadingText('আহবানী'),
            SimpleText('তমসার পার- অচ্ছেদ্যবর্ণ\nমহান্ পুরুষ ইষ্টপ্রতীকে আবির্ভূত!\nযদ্বিদাচরণে তদুপাসনাতেই ব্রতী হই!\n-জাগ্রত হও আগমন কর-\nআমরা যেন একেই অভিগমন করি,\nএক উদ্দেশ্যেই বাক্-কর্ম বিনিয়োগ করি,\nএক নিরন্তরতায় সেই তাঁকেই যেন জানিতে পারি;\nশ্রদ্ধানুসৃত আপূর্য্যমাণ ইষ্টেকপ্রাণনায়\nএকই মন্ত্রে, একই মননে সমষ্টি-উতসারণায়\nবৈশিষ্ট্যপূরণী একচেতনাভিমন্ত্রণে\nশিষ্ট হবিঃ ওঁ শ্রেষ্ঠ হবনায়\nসমান আকুতি ও সম্যক হৃদয়ে\nজীবন-বর্দ্ধনে ঋদ্ধিমান হই!\nস্বস্তি! স্বস্তি! স্বস্তি!'),
            HeadingText("পুরুষোত্তম প্রণাম"),
            SimpleText('বন্দে লোকতিলকং সাত্বতবার্ত্তা-বিভূষণং\nঅমরকৃত্যুসারণং প্রবুদ্ধং লোকজীবনং\nপ্রণয়-প্রমত্ত-যাগদীপনং\nবন্দে জীবন-জীবনং সৎপুরুষম্ '),
            HeadingText('সন্ধ্যাকালীন বিনতি'),
            SimpleText('বার বার করু বিনতি, রাধাস্বামী আগে।\nদয়া করো দাতা মেরে, চিত চরণন লাগে।।\nজনম্-জনম্ রহি ভুল মে, নহি পায়া ভেদা।\nকাল করম্কে জাল মে, রহি ভোগত খেদা।।\nজগত জীব ভরমত ফিরে, নিত চারো খানী।\nজ্ঞানী যোগী পিল্ রহে, সব মন কি ঘানী।।\nভাগ জগা মেরা আদিকা, মিলে সদ্গুরু আই।\nরাধাস্বামী ধাম কা, মোহি ভেদ জনাই।।\nউঁচা সে উঁচা দেশ হ্যায়, অহ অধর ঠিকানী।\n বিনা সন্ত পাওয়ে নহী, শ্রুত শব্দ নিশানী।।\nরাধাস্বামী নাম কী, মোহি মোহিমা শুনাই।\nবিরহ অনুরাগ জগায়কে, ঘর পঁহুচু ভাই।।\nসাধ সঙ্গ কর সার রস, মৈনে পিয়া অঘাই।\nপ্রেম লগা গুরু চরণ মেঁ, মন শান্ত ন আই।।\nতড়প উঠে বেকল্ রহুঁ, কৈসে পিয়া ঘর যাই।\nদরশন রস নিত নিত লহুঁ, গহে মন থিরতাই।।\nসুরত চঢ়ে আকাশ মেঁ, করে শব্দ বিলাসা।\nধাম ধাম নিরখত চলে, পাওয়ে নিজ ঘর বাসা।।\nইয়হ আশা মেরে মন বসে, রহে চিত্ উদাসা।\nবিনয় শুনো কির্পা করো, দীজে চরণ নিবাসা।।\nতুম্ বিন কোই সমরথ নহী, জাসে মাগুঁ দানা।\nপ্রেমধার বরখা করো, খোলো অমৃত খানা।।\nদীন দয়াল দয়া করো, মেরে সমরথ স্বামী।\nসুকর কঁরু গাওয়ত রহুঁ, নিত রাধাস্বামী।।'),
            HeadingText('প্রাতঃ ও সন্দধ্যাকালীন বিনতি'),
            SimpleText('বার্ বার্ কর জোড় কর্, সবিনয় কঁরু পুকার।\nসাধ সঙ্গ মোহি দেও নিত, পরম গুরু দাতার।।\nকৃপাসিন্দধু সমরথ পুরুষ, আদি অনাদি অপার।\nরাধাস্বামী পরম পিতু, মৈ তুম সদা অধার।।\nবার বার বল জাঁউ, তন্ মন্ ওয়ারুঁ চরণ পর।\nক্যা মুখ লে ম্যাঁয় গাউঁ, মেহর করী জস্ কৃপা কর্।।\nধন্য ধন্য গুরুদেও, দয়াসিন্দধু পূরণ ধনী।\nনিত্য কঁরু তুম্ সেও, অচল শক্তি মোহি দেও প্রভু।।\nদীন অধীন অনাথ, হাথ গহা তুম্ আনকর্।\nঅব রাখো নিত সাথ, দীন দয়াল কৃপানিধি।।\nকাম ক্রোধ মদ লোভ, সব বিধি অবগুণ হার মৈ।\nপ্রভু রাখো মেরি লাজ, তুম দ্বারে অব্ মৈ পড়া।।\nরাধাস্বামী গুরু সমরথ, তুম বিনা আউর্ ন দুসরা।\nঅব করো দয়া পর্তক্ষ, তুম দর এতী বিলম্ব কেঁও।।\nদয়া করো মেরে সাঁইয়া, দেও প্রেম কী দাত।\nদুঃখ সুখ কুছ ব্যাপে নহী, ছুটে সব উৎপাত।।'),
            HeadingText('আচমন'),
            SimpleText('হে পরমকারুণিক! হে সর্ব, হে সর্বানুস্যত! ব্যাপ্ত প্রাক, প্রথম বাক! সর্ব স্বর্গ সর্বহৃদয় - প্রাণন - পরিমল অদ্বিতীয়, ঈশ্বর! জীবজগৎরূপে প্রতিভাত! রক্তমাংস - সংকুল - উদ্ভাসিত তুমিই তোমার তজ্জাত সন্তান! এই আমিও তোমার তুমিরই উৎক্ষেপ এই ভারাক্রান্ত হৃদয়ের যা-কিছু মলিনতা উৎসারিত অমৃত-আশিষে জরা-মরণ-দুঃখ-দুরিত-বিপত্তি যা-কিছু অপসারিত করিয়া তোমাতে উদ্ভাসিত করিয়া তোল! এই আমি আমার আব্রহহ্মস্তম্ভ পর্য্যন্ত তোমাকে স্মরণ করিয়া অমৃত আচমনে পবিত্র হইলাম!\nআমি পবিত্র! আমি পবিত্র! আমি পবিত্র! '),
            HeadingText('পুরুষোত্তম বন্দনা'),
            SimpleText('বন্দে পুরুষোত্তম!\nত্বাং হীষ্টং হৃদয়োতসবৎ শ্রীবিগ্রহম্\nবৈশিষ্ট্যপূরকং সমষ্ট্যুৎসারকম্ একাচারিণম্!\nসৃজনোৎসৎ ত্বামীশ্বরং প্রকটপরায়ণম্\nনিখিলজগজ্জীবজীবনবীচিস্পদিতম্ ব্যক্তাব্যক্তস্বরূপকম্ পরমদৈবতম্\nব্যক্তাব্যক্তস্বরূপকম্ পরমদৈবতম্ নরং নারায়ণম্!\nমৎস্য-কূর্ম-কোল-নৃসিংহ-বামন শারীরম্\nরাম - কৃষ্ণ - বুদ্ধ - যীশু - মোহাম্মদ রূপায়িতম্\nচৈতন্য - রামকৃষ্ণানুকূলং পূর্বতনীপূরণম্\nশাশ্বতং বর্ত্তমানম্!\nব্যক্তি - দম্পতি - গৃহ - সমাজ - রাষ্ট্রোদ্ধারণে\n যজন - যাজনেষ্টভৃতি - স্বস্ত্যয়নী - প্রবর্ত্তকম্\nআর্য্য - চিরায়ণম্!\nআর্য্যকৃষ্টি - তূর্য্যধবনিত পল্লীনিকেতনম্!আর্য্যভূমিধূলিপাবন চিদানন্দকম্\nসকল শিল্প বিজ্ঞান যুতং পূর্ণং পুরাণং পরাৎপরকম্।\nধর্মগ্লানিত্রস্ত - ভুবনে বৃত্তিঘূর্ণনে\nসকল বাদব্যা মোহহর সদ্ধর্মস্থাপকম্‌।\nআপূরয়ন্ত মিষ্ট মেকম দ্বিতীয়কম্‌ যুগাদর্শমনুত্তমম্‌!\nপ্রেমাচ্ছল নরবপুর্দ্রৃতং মন্মথমন্মথম্‌\nনবীনার্য্যতীর্থস্করং বিচিত্রলীলকম্‌\nবিশ্বমিলনহবন - নবীনবেদদায়িনম্‌ বিনায়কভাস্করম্‌।\nরণতান্ডবদ্রোহেক্ষুব্দধে ক্লিষ্ঠে বিশ্লিষ্টে লোকে\nঅভ্যুত্থিত স্লেচ্ছাচারাপূরিত দিংমন্ডলে\nজীবনবৃদ্ধ্যসিকলকং মিত্রামিত্রবল্লভম্‌ কল্কিরূপমুদগ্রম্‌\nনমামি বিপ্লাবিনং প্রিয়ং পরমং কমমপি করালম্‌।\nপুরুষোত্তমম্‌! পুরুষোত্তমম্‌! বন্দে পুরুষোত্তমম্‌‌‌'),
            HeadingText('সমবেত প্রার্থনা বা আর্য্য সন্ধ্যা (৬)'),
            SimpleText('যিনি সব যাহা কিছুতে বৃদ্ধিপ্রাপ্ত হইয়া দেদীপ্যমান সেই ব্রহ্মকে নমস্কার করি। আর সেই ব্রাহ্মণ - যিনি তাঁহাকে জানিয়াছেন, তাঁহাকে আমার অশেষ নমস্কার! যে আচরণে তাঁহাকে জানা যায়, সেই আচারকে যিনি আচরণ দ্বারা জানাইয়া থাকেন সেই আচার্য্যকে প্রণিপাত করিতেছি (১)। যাঁহারা দ্রষ্টাপুরুষ সেই ঋষিদিগকে নমস্কার করি। যিনি মানুষের জীবন ও বুদ্ধিকে সেবা ও সাহচর্য্যে উদ্দীপ্ত করিয়া প্রত্যেকে হৃদয়ে দীপ্তিমান সেই দেবতাকে নমস্কার করিতেছি।'),
            HeadingText('সদ্‌গুরু স্তোত্র'),
            SimpleText('গুরুর্ব্রহ্মা গুরুর্বিষ্ণু গুরুর্দেব মহেশ্বর।\nগুরুরেব পরংব্রহ্ম তস্মৈ শ্রীগুরুবে নমঃ।।\nঅখন্ডমন্ডলাকারং ব্যাপ্তং যেন চরাচরম্‌।\nতৎপদং দর্শিতং যেন তস্মৈ শ্রীগুরুবে নমঃ।।\nঅজ্ঞানতিমিরান্দধস্য জ্ঞানঞ্জন শলাকয়া।\nচক্ষুরুন্মীলিতং যেন তস্মৈ শ্রীগুরুবে নমঃ।।\nস্থাবরং জঙ্গমং ব্যাপ্তং যেন কৃতস্নং চরাচরম্‌।\nতৎপদং দর্শিতং যেন তস্মৈ শ্রীগুরুবে নমঃ।।\nচিদ্রুপেণ পরিব্যাপ্তং ত্রৈলোক্যং সচরাচরম্‌।\nতৎপদং দর্শিতং যেন তস্মৈ শ্রীগুরুবে নমঃ।।\nন গুরোরধিকং তত্তং ন গুরোরধিকং তপঃ।\nতত্বজ্ঞানাৎ পরং নাস্তি তস্মৈ শ্রীগ্রুরুবে নমঃ।।\nমন্নাথঃ শ্রীজগন্নাথো মদগুরুঃ শ্রীজগদগুরু।\nমদাত্মা সর্বভূতাত্মা তস্মৈ শ্রী গুরুবে নমঃ।।\nগুরুরাদিরনাদিশ্চ গুরুঃ পরমদৈবতম্।\nগুরোঃ পরতরং নাস্তি তস্মৈ শ্রীগুরুবে নমঃ।।\nব্রহ্মানন্দং পরমসুখদং কেবলং জ্ঞানমূর্ত্তিম্‌।\nদ্বন্দ্বাতীতং গগনসর্দৃশং তত্ত্বমস্যাদি লক্ষ্যম্‌।।\nএকং নিত্যং বিমলচলং সর্বধীসাক্ষীভূতম্‌।ভাবাতীতং ত্রিগুণরহিতং সদ্‌গুরু ত্বাং নমামি।।‌'),
            HeadingText('পঞ্চবর্হি'),
            SimpleText('১। একমেবাদ্বিতীয়ং শরণম্\n২। পূর্ব্বেষামাপূরয়িতারঃঋষয়ঃ শরণম্‌।\n৩। তদবর্ত্মানুবর্ত্তিতঃ পিতরঃশরণম্‌।\n৪। সত্তানুগুণা বর্ণাশ্রমাঃ শরণম্‌।\n৫। পূর্বাপূরকো বর্ত্তমানঃ পুরুষোতমঃ শরণম্‌। এতদেবার্য্যর্যায়ণম এষ এব সন্দধর্মঃ এতদেব শাশ্বতং শরণ্যম্‌।‌'),
          ],
        ),
      ),
    );
  }
}
